# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [ ]:
#Your code here
import sqlite3
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = connection.cursor()

In [36]:
import pandas as pd

def sql_run(query):
    return pd.DataFrame(cur.execute(query).fetchall())

## Display the names of all the employees in Boston.

In [37]:
#Your code here
sql_run('''SELECT firstName, lastName
                FROM employees
                JOIN offices
                USING(officeCode)
                WHERE city = 'Boston';''')

       0          1
0  Julie   Firrelli
1  Steve  Patterson

## Do any offices have no employees?

In [38]:
#Your code here
sql_run('''SELECT offices.City, COUNT(*)
           FROM employees
           LEFT JOIN offices
           USING(officeCode)
           GROUP BY offices.officeCode;
        ''')

               0  1
0  San Francisco  6
1         Boston  2
2            NYC  2
3          Paris  5
4          Tokyo  2
5         Sydney  4
6         London  2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [41]:
# Your code here
# Sale results per rep
sql_run('''SELECT e.firstName, e.lastName, SUM(p.amount) as total_sales
           FROM employees e
           JOIN customers c ON e.employeeNumber = salesRepEmployeeNumber
           JOIN payments p USING(customerNumber)
           GROUP BY p.amount
           ORDER BY total_sales DESC
           LIMit;
            ''')

            0          1          2
0      Gerard  Hernandez  120166.58
1      Gerard  Hernandez  116208.40
2      Leslie   Jennings  111654.40
3        Mami      Nishi  105743.00
4      Leslie   Jennings  101244.59
5      Leslie   Jennings   85559.12
6      Leslie   Jennings   85410.87
7       Barry      Jones   85024.46
8      Leslie   Jennings   83598.04
9        Andy     Fixter   82261.22
10     Leslie   Thompson   80375.24
11      Peter      Marsh   75020.13
12     Gerard  Hernandez   65071.26
13     Gerard  Hernandez   63843.55
14      Steve  Patterson   63357.13
15     Martin     Gerard   61402.00
16      Barry      Jones   61234.67
17     Gerard  Hernandez   59830.55
18     Leslie   Jennings   59551.38
19      Julie   Firrelli   59265.14
20   Foon Yue      Tseng   58841.35
21   Foon Yue      Tseng   58793.53
22     Martin     Gerard   57131.92
23     Leslie   Jennings   55639.66
24      Steve  Patterson   55425.77
25     Pamela   Castillo   53959.21
26     Pamela   Castillo   53745.34
27     Gerard  Hernandez   53116.99
28      Larry       Bott   52825.29
29      Julie   Firrelli   52548.49
..        ...        ...        ...
243    George     Vanauf    7178.66
244    George     Vanauf    6631.36
245    Pamela   Castillo    6419.84
246     Julie   Firrelli    6276.60
247    Gerard  Hernandez    6066.78
248     Steve  Patterson    6036.96
249    George     Vanauf    5899.38
250     Steve  Patterson    5858.56
251    Gerard  Hernandez    5759.42
252  Foon Yue      Tseng    5494.78
253    Pamela   Castillo    4710.73
254    Gerard  Hernandez    4632.31
255    Leslie   Thompson    4465.85
256     Julie   Firrelli    4424.40
257    Leslie   Thompson    3879.96
258      Mami      Nishi    3516.04
259    Martin     Gerard    3474.66
260    Leslie   Thompson    3452.75
261    Martin     Gerard    3101.40
262     Peter      Marsh    2880.00
263      Mami      Nishi    2611.84
264    Leslie   Jennings    2434.25
265      Loui     Bondur    1960.80
266      Loui     Bondur    1834.56
267  Foon Yue      Tseng    1679.92
268    Gerard  Hernandez    1676.14
269    Pamela   Castillo    1627.56
270     Barry      Jones    1491.38
271    Pamela   Castillo    1128.20
272      Mami      Nishi     615.45

[273 rows x 3 columns]

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!